export const plateformDict: any = {
    0: '优品课堂',
    1: '视频号',
    2: '抖音',
    3: '小鹅通',
    4: '同花顺',
    5: '快手'
};
export const plateformDictAdd: any = {
    1: '视频号',
    2: "抖音",
    3: '小鹅通',
    4: '同花顺',
    5: '快手'
};
export const plateformList: any = [
    { label: '优品课堂', value: 0 },
    { label: '视频号', value: 1 },
    { label: '抖音', value: 2 },
    { label: '小鹅通', value: 3 },
    { label: '同花顺', value: 4 },
    { label: '快手', value: 5 }
]

export const plateformListAdd: any = [
    { label: '视频号', value: 1 },
    { label: '抖音', value: 2 },
    { label: '小鹅通', value: 3 },
    { label: '同花顺', value: 4 },
    { label: '快手', value: 5 }
]
export const plateImgDict: any = {
    0: 'logo.png',
    1: 'logo.png',
    2: 'logo.png',
    3: 'logo.png',
    4: 'logo.png',
    5: 'logo.png',
}
// 报备审核映射
export const auditStatusDict: any = {
    1: '未审核',
    2: '不通过',
    3: '通过'
};
export const auditStatusList: any = [
    { label: '未审核', value: 1 },
    { label: '不通过', value: 2 },
    { label: '通过', value: 3 }
]
export const auditStatusColorDict: any = {
    '-1': '#596175',
    1: '#838BA1',
    2: '#FF2323',
    3: 'green'
};

// 违规审核映射
export const auditVioStatusDict: any = {
    '-1': '未知',
    0: '未审核',
    1: '不通过',
    2: '通过'
};
export const auditVioStatusList: any = [
    { label: '未知', value: -1 },
    { label: '未审核', value: 0 },
    { label: '不通过', value: 1 },
    { label: '通过', value: 2 }
]
export const auditVioStatusColorDict: any = {
    '-1': '#596175',
    0: '#838BA1',
    1: '#FF2323',
    2: 'green'
};

export const departListDict: any = [
    { label: '深圳团队专用', value: '1' },
    { label: '武汉区主播专用', value: '2' },
    { label: '北京区主播专用', value: '3' }
];
export const departObj: any = {
    '1': '深圳团队专用',
    '2': '武汉区主播专用',
    '3': '北京区主播专用'
};

export const labelTypeList: any = [
    // { label: '未知', id: '-1', children: [] },
    { label: '视频风险', id: '1', children: [] },
    { label: '音频风险', id: '2', children: [] },
    { label: '图文风险', id: '3', children: [] },
    { label: '自定义违规', id: '4', children: [] }
];
export const labelTypeDict: any = {
    '-1': '未知',
    1: '视频风险',
    2: '音频风险',
    3: '图文风险',
    4: '自定义违规'
};

export const violationDict: any = {
    401001: '通用色情',
    401002: '通用低俗',
    401003: '色情动作',
    401004: '色情物体',
    401005: '色情动漫',
    401006: '色情裸露',
    401007: '性行为',
    401008: '性暗示',
    401009: '动物性器官',
    401010: '性分泌物',
    404001: '色情广告',
    404002: '不当交友广告',
    404003: '招嫖广告',
    404004: '医疗广告',
    404005: '赌博广告',
    405001: '恶心引人不适',
    405002: '虐待动物',
    405003: '恐怖引人不适',
    405004: '尸体引人不适',
    405005: '血腥引人不适',
    406001: '图片武器',
    406002: '违禁药品',
    406003: '赌博',
    406004: '涉爆物品',
    406005: '打架',
    406006: '图片爆炸',
    406007: '野生动物相关',
    406008: '劣迹艺人',
    407001: '二维码',
    408001: '诈骗',
    408002: '刷单致富诈骗',
    408003: '招工致富诈骗',
    408004: '投资理财诈骗',
    408005: '金融征信诈骗',
    408006: '解除账号限制类诈骗',
    408007: '仿冒客服',
    408008: '仿冒明星',
    408009: '宠粉诈骗',
    409001: '自我伤害',
    409002: '夸张吃播',
    409003: '丧葬恶搞',
    409004: '不良社会风气',
    409005: '不当车播',
    409006: '吸烟',
    410001: '儿童色情',
    410002: '儿童低俗',
    410003: '未成年吸烟',
    410004: '未成年喝酒',
    410005: '儿童邪典',
    411001: '女肩部裸露',
    411002: '女背部裸露',
    411003: '女胸部露沟',
    411004: '女胸部侧漏',
    411005: '女背部全裸',
    411006: '女腰腹部裸露',
    411007: '女腿部裸露',
    411008: '臀部裸露',
    411009: '女胸部特写',
    411010: '女腹部特写',
    411011: '女腿部特写',
    411012: '女脚部特写',
    411013: '女开腿',
    411014: '女诱惑动作',
    411015: '疑似未穿衣',
    411016: '女正常内衣裤',
    411017: '黑丝',
    411018: '紧身衣',
    411019: '男内裤',
    411020: '男性上身裸露',
    411021: '亲吻',
    411022: '舌吻',
    411023: '摸胸下体',
    411024: '穿衣性行为',
    411025: '动物性行为',
    411026: '未拆封避孕套',
    411027: '搂抱',
    420001: '涉黄',
    420002: '涉敏1',
    420003: '涉敏2',
    420004: '广告',
    420005: '谩骂',
    420006: '违禁',
    420007: '联系方式',
    420008: '诈骗',
    420096: '黑名单',
    420097: '白名单',
    420098: '疑似名单',
    420099: '自定义',
    451001: '模糊',
    451002: '纯色边框',
    451003: '滤镜',
    451004: '马赛克',
    451005: '水印',
    451006: '纯色屏',
    451007: '镜像',
    451008: '录屏',
    451009: '放大视频',
    451010: '轮播视频',
    451011: '滚字视频',
    451012: '二次剪辑视频',
    451013: '静帧视频',
    451014: '大字',
    451015: '横屏',
    452001: '婴儿',
    452002: '幼儿',
    452003: '学龄前儿童',
    452004: '未成年儿童',
    452005: '青年',
    452006: '中年',
    452007: '老年',
    499001: '黑名单',
    499002: '白名单',
    499003: '疑似名单',
    499004: '自定义',

    201001: '高危色情',
    201002: '性骚扰',
    201003: '性暗示',
    201004: '性癖好',
    201005: '性侮辱',
    201099: '呻吟娇喘声',
    202001: '音频涉敏1',
    202099: '枪声爆炸声',
    203001: '音频涉敏2',
    203099: '声纹涉敏2(当前版本不返回)',
    204001: '色情广告',
    204002: '招嫖广告',
    204003: '医疗广告',
    204004: '美容美体广告',
    204005: '赌博广告',
    204006: '售假广告',
    204007: '普通商业广告',
    204008: '游戏交易广告',
    204009: '游戏拉人广告',
    204010: '放贷催收广告',
    204011: '互粉互赞广告',
    204012: '招聘广告',
    204013: '账号买卖广告',
    204014: '黑灰产广告',
    204015: '站内导流',
    204016: '站外导流',
    205001: '恶意攻击',
    205002: '轻度攻击',
    205003: '不文明用语',
    206001: '毒品',
    206002: '赌博',
    206003: '违禁品',
    206004: '违禁行为',
    206005: '劣迹艺人',
    207001: '联系方式',
    207002: 'URL',
    207005: 'email',
    208001: '杀猪盘诈骗',
    208002: '刷单致富诈骗',
    208003: '招工致富诈骗',
    208004: '投资理财诈骗',
    208005: '金融征信诈骗',
    208006: '卖惨人设诈骗',
    208007: '解除账号限制类诈骗',
    208008: '盗号诈骗',
    299001: '用户自定义黑名单',
    299002: '用户自定义白名单',
    299003: '用户自定义疑似名单',
    299004: '自定义',
    201: '涉黄',
    202: '涉敏1',
    203: '涉敏2',
    204: '广告',
    205: '谩骂',
    206: '违禁',
    207: '联系方式',
    208: '诈骗',
    299: '自定义',
    401: '涉黄',
    402: '涉敏1',
    403: '涉敏2',
    404: '广告',
    405: '引人不适',
    406: '违禁',
    407: '二维码',
    408: '诈骗',
    409: '不良画面',
    410: '未成年相关',
    411: '性感低俗',
    420: '文字违规',
    451: '图片质量',
    452: '年龄识别',
    499: '自定义'
};

export const logDict: any = {
    1: "管理",
    2: "登录",
    3: "错误",
    4: "新增(直播)",
    5: "修改(直播)",
    6: "审核(直播)",
    7: "删除(直播)",
}

export const logType: any = [
    {
        value: "",
        name: "全部",
    },
    {
        value: 1,
        name: "管理",
    },
    {
        value: 2,
        name: "登录",
    },
    {
        value: 3,
        name: "错误",
    },
    {
        value: 4,
        name: "新增(直播)",
    },
    {
        value: 5,
        name: "修改(直播)",
    },
    {
        value: 6,
        name: "审核(直播)",
    },
    {
        value: 7,
        name: "删除(直播)",
    },

]