/* WEB 错误信息 */

module.exports = ErrorObj = {
    '0': '成功',

    '9':'资源被使用,请先清空已分配的资源',
    '15':'修改的预约券数量小于已分配的数量',
    '10001': '请求参数错误',
    '10002': '用户已存在',


    '20001': 'Token失效，请重新登录后提交',
    '20002': 'Token解析失败，请重新登录后提交',

    '30001': '请求超时',

    '80001': '用户已存在',
    '80002': '用户不存在',
    '80003': '该用户非后台管理用户',
    '80004': '账户/密码错误',
    '80005': '用户密码设置失败',
    '80006':'账号被禁用',
    '90001': '机构已存在',
    '90002': '创建失败',
    '90003': '编辑失败',
    '90004': '管理员账号已存在',
    '90005': '柜台节点已存在',
    '90006': '柜台/机构关联关系已存在',
    '90007': '资产包ID已存在',
    '90008': '此资金账号下无该股票信息，无法分配',


};



